using System;
using System.Collections.Generic;
using System.Text;

namespace BotAnbotip.Bot.Data.Group
{
    public enum LevelRoleIds : ulong
    {
        Медь1 = 466232056813453316,
        Медь2 = 466232056037507092,
        Медь3 = 466232054963634187,
        Бронза1 = 466232053403353109,
        Бронза2 = 466232051708985354,
        Бронза3 = 466232049397661696,
        Серебро1 = 466232046545797141,
        Серебро2 = 466232043764842497,
        Серебро3 = 466232041172631553,
        Золото1 = 466232038727483422,
        Золото2 = 466232035594207232,
        Золото3 = 466232033052590080,
        Платина1 = 466232030498390026,
        Платина2 = 466232027637874709,
        Платина3 = 466232025142001664,
        Сапфир1 = 466232022424092674,
        Сапфир2 = 466232019983138846,
        Сапфир3 = 466232017080811531,
        Изумруд1 = 466232014803173379,
        Изумруд2 = 466232012257230859,
        Изумруд3 = 466232009707094027,
        Рубин1 = 466232006523617300,
        Рубин2 = 466232004623597568,
        Рубин3 = 466232001738047491,
        Алмаз1 = 466231998936121345,
        Алмаз2 = 466231996566470676,
        Алмаз3 = 466231993429000193,
        Магма1 = 466231990694182922,
        Магма2 = 466231987636535327,
        Магма3 = 466231985237393448,
        Тёмная_материя1 = 466231975062011924,
        Тёмная_материя2 = 466231972222730251,
        Тёмная_материя3 = 466231969827782676,
        Сингулярность = 466231966816010261
    }
}
