using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace BotAnbotip.Bot.Data.Group
{
    public enum RoleIds : ulong
    {
        VIP = 434769334527721473,
        Основатель = 384404017167728640,
        Заместитель = 422488912993189888,
        Динамический_цвет = 422841190971342849,
        Администратор = 422488498248089611,
        Модератор = 422612691002195979,
        Активный_Участник = 422730598839353354,
        Участник = 422489018341785601,
        Музыкальный_Бот = 402357764296540173,
        Главный_Бот = 422350525191684097,
        _Бот = 434084164371742735,
        Чат_Бот = 424299473175314433,
        Backend_Bot = 440874062416183336,
        Любитель_Аниме = 422499730484887593,
        _ = 434070503817478176
    }
}
